import datetime
from secret import files

# Main Data (serverID, datetime object of Unix-zero-seconds, paths)
servers = 1139692253762297896
year1970 = datetime.datetime(1970, 1, 1, 3)
opus_path = "/opt/homebrew/opt/opus/lib/libopus.dylib"
# opus_path = "/usr/lib/x86_64-linux-gnu/libopus.so"
###################################################################################

# Roles
OWNER = 1254001588390068317  # Владелец
ADMIN = 1243745222064865280  # Администратор
POLICE = 1140031278209564753  # Парульный
BOTS = 1145146936819712030  # Бот
BAN = 1245048847219032085  # BAN
MUTE = 1255120808704081940  # Мьют
UPDATE = 1258178779239419925  # Сервер обновляется
VERIFY = 1245822031149273179  # No verify
DONAT = 1259472451612573796  # Донатер
BUSTER = 1139912574956228629  # Бустер
MINECRAFT = 1243744426493476918  # Майнкрафт
VALORANT = 1249354887893094421  # Valorant
STALCRAFT = 1324187072336232531  # Stalcraft
CS = 1249355294543319060  # CS
BOARD = 1249356177557688435  # Настольщик
SCHOOL_179 = 1249356995891298447  # 179
SCHOOL_444 = 1243743826280189963  # 444
SCHOOL_1514 = 1249357606124785708  # 1514
FEM = 1247757869013794846  # Девушка
MAN = 1247758101306675311  # Парень
###################################################################################

# Chats
RULES = 1244302018395246772  # правила
NEWS = 1244359295299096630  # новости-анонсы
VERIFICATION = 1245822647531737108  # верификация
BANNED = 1257139875384131645  # banned
UPDATE_CHAT = 1258180289973321850  # обновление
MUSIC = 1244407609583468637  # музыка
LEGACYOFF = 1139978261858877625  # запрещенка
CHAT = 1244401066909499543  # чат
REPORTS = 1145136908867993611  # жалобы
ADM_PUBLIC = 1244309428123996211  # приемная
ADM_REPORTS = 1146682871784935554  # reports
ADM_CHAT = 1146399464379138109  # chat
AUDIT = 1256309242944688138  # аудит
INFO_BANS_AUDIT = 1296143780352753744 # аудит банов в информатике
INFO_THEMES_AUDIT = 1296144004106162217 # аудит о темах в информатике
INFO_ANSWERS_AUDIT = 1296143913190555688 # аудит ответов в информатике
MY_PRIVATE = 1247389233585590385  # мое
DEV = 1264362184532557885  # DEV
MAFIA = 1273769325198839979 # мафия
###################################################################################

# Voices
MEET_PLACE = 1140017821091369041  # место встречи
TRIBUNE = 1244376420655038464  # Lofi
ADM_VOICE = 1146688425542561822  # voice
COURT = 1254394923432542308  # суд
MAFIA_ROOM_1 = 1280648090151293010 # Комната для игры в мафию 1
MAFIA_ROOM_2 = 1280649316318445620 # Комната для игры в мафию 2
MAFIA_ROOM_3 = 1280649335163322399 # Комната для игры в мафию 3

A_UNLIMIT = 1244360549026762772  # UNLIMIT
B_UNLIMIT = 1244366368963297321  # UNLIMIT

A_MAX5 = 1244360765784330240  # MAX 5
B_MAX5 = 1248074865890689095  # MAX 5

A_MAX4 = 1244360803185066004  # MAX 4
B_MAX4 = 1244366446021050501  # MAX 4

A_MAX3 = 1244360888601940020  # MAX 3
B_MAX3 = 1244366483002228869  # MAX 3

A_MAX2 = 1244360934504398990  # MAX 2
B_MAX2 = 1244366511997587550  # MAX 2
###################################################################################

# Categories
CHATS = 1139978398530273383
A_PARTY = 1244349889379303485
B_PARTY = 1244361285706059866
ADM = 1145024215024677035

# Threads
STALCRAFT_THREAD = 1322702179311681628
VALORANT_THREAD = 1249501628231454893
MINECRAFT_THREAD = 1249501855285907568
CS_THREAD = 1249501922063421440
BOARD_THREAD = 1249502271625232404
SCHOOL_179_THREAD = 1249502007694196870
SCHOOL_444_THREAD = 1249502064636067932
SCHOOL_1514_THREAD = 1249502135901622272
###################################################################################

# Emoji
yes_emoji = "<:yes:1279170060103057520>"
no_emoji = "<:no:1279169869975130163>"
stop_emoji = "<:stop:1279208435996430367>"
bot_emoji = "<:bot:1291840772550824008>"
###################################################################################

# Images
mf_img_night = files + "night.png"
mf_img_logo = files + "logo.png"
mf_img_day = files + "day.png"
mf_img_detective = files + "detectivate.png"
mf_img_doctor = files + "doctor.png"
mf_img_baby = files + "baby.png"
mf_img_police = files + "police.png"
mf_img_thief = files + "thief.png"
mf_img_people = files + "people.png"
mf_img_mafia = files + "mafia.png"
